app/Controllers/Post.php

SELECT *
FROM `article`
---
    public function index()
    {
        $post_model = new Post_model();
        $data = [
            'article'   => $post_model->findAll()
        ];